[
  {
    "name": "Holly Carroll",
    "rating": "5",
    "text": "My husband got me and my mother-in-law gift certificates for Bryce's Detailing for Christmas and we just redeemed them. My SUV was destroyed from the fall softball season with dirt, sand, crumbs and all kinds of sticky stuff. After 4 hours …"
  },
  {
    "name": "Erin Servin",
    "rating": "5",
    "text": "Bryce does an amazing and thorough job. I could not recommend his services more highly. He has integrity, communicates well, and you feel like you have a completely new vehicle when he’s finished! 10/10"
  },
  {
    "name": "Christopher Kamel",
    "rating": "5",
    "text": "If you asked me to describe Bryce’s Detailing in a few words I’d say - Communication, reliability, integrity, fairness, DETAILED! You won’t want to take your vehicle anywhere else after hiring Bryce. Send your friends and family to him and they’ll be treated as such. Thank you!"
  },
  {
    "name": "Chris Krchnavi",
    "rating": "5",
    "text": "Top Notch work! Truck looks better then it did from brand new Bryce went above and beyond and absolutely made this truck shine like it never has before! 10/10 attention to detail highly recommended"
  },
  {
    "name": "Jose “JJ” Clark",
    "rating": "5",
    "text": "If your looking for attention to “Detail”, Bryce will definitely deliver. Bryce’s efficiency is unmatched, and the attention to detail is extraordinary. I highly recommend Bryce’s detailing for anyone looking for top-notch service and meticulous care for their vehicle. Absolutely outstanding!"
  },
  {
    "name": "Lorina Hunsberger",
    "rating": "5",
    "text": "My vehicle looks BRAND new every time, inside and out. Bryce is communicative, easy to schedule with and convenient location."
  },
  {
    "name": "Alison Wright",
    "rating": "5",
    "text": "Unbelievably PERFECT detailing work! My husband arranged to try this service, and I have never even met this detailer. …"
  },
  {
    "name": "michelle lanzillotti",
    "rating": "5",
    "text": "I cannot believe how beautiful my interior came out. My Sienna is 16 years old and is well loved. It carted stinky hockey players for YEARS!  Bryce made those years DISAPPEAR!  I would highly recommend Bryce’s Detailing!! Absolutely spectacular!! Thanks Bryce!!"
  },
  {
    "name": "Michael Broughton",
    "rating": "5",
    "text": "I just moved to the area and was looking for a place to take my STI for a full detail (interior and exterior) with a 2 step paint correction to clean up some scratches I had gotten at my old apartment complex. I found this place on maps …"
  },
  {
    "name": "Sabrina Wilder",
    "rating": "5",
    "text": "Without question the best level of service.  Very professional and does an incredible job! Highly recommended!"
  },
  {
    "name": "Andrew Kratz",
    "rating": "5",
    "text": "Bryce's talent is absolutely unmatched! His attention to detail is so impressive it always leaves me wondering \"how does he do it!?\". Do yourself (and your vehicle) a favor and get on his schedule NOW!"
  }
]